app/views/staffs/show.html.erb

					</tr>
					<% @staff.customers.each do |customer| %>
---
SELECT "customers".* FROM "customers"  WHERE "customers"."staff_id" = ?  [["staff_id", 3]]