app/controllers/customers_controller.rb

SELECT "customers".* FROM "customers" INNER JOIN "staffs" ON "customers"."staff_id" = "staffs"."id" WHERE "staffs"."user_id" = ?  [["user_id", 2]]
---
	def index
		@customers = current_user.customers.all

SELECT  "customers".* FROM "customers" INNER JOIN "staffs" ON "customers"."staff_id" = "staffs"."id" WHERE "staffs"."user_id" = ? AND "customers"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
---
	def show
		@customer = current_user.customers.find(params[:id])

SELECT COUNT(*) FROM "customers"
SELECT  "customers".* FROM "customers"  LIMIT 5 OFFSET 5
---
	def next_page
		page_num = params[:page].to_i
		@customers = current_user.customers.pagination(page_num, 5)
		page_count = current_user.customers.count / 5;

		cust_name = Array.new
		@customers.each do |t|