app/controllers/days_controller.rb

SELECT "days".* FROM "days"  WHERE "days"."user_id" = ?  [["user_id", 2]]
---
	def index
		@days = current_user.days.all

SELECT  "days".* FROM "days"   ORDER BY "days"."id" DESC LIMIT 1
SELECT  "staffs".* FROM "staffs"  WHERE "staffs"."user_id" = ? AND "staffs"."id" = ? LIMIT 1  [["user_id", 1], ["id", 1]]
SELECT "customers".* FROM "customers"  WHERE "customers"."staff_id" = ?  [["staff_id", 1]]
UPDATE "staffs" SET "happiness" = ?, "performance" = ?, "updated_at" = ? WHERE "staffs"."id" = 6  [["happiness", 60], ["performance", 13], ["updated_at", "2014-10-12 05:59:12.134702"]]
UPDATE "users" SET "money" = ?, "updated_at" = ? WHERE "users"."id" = 1  [["money", -1600], ["updated_at", "2014-10-12 05:57:29.113880"]]
---
	def create
		if Day.last.nil?
			last_day_nubmer = 0
		else
			last_day_nubmer = Day.last.day_number
		end

		user = current_user #ManagerDescriptor
		manager_descriptor = ManagerDescriptor.new(user.email, user.email)
		manager_descriptor.money = current_user.money

		# These two are arrays
		staff_descriptor    = staff_description
		customer_descriptor = Array.new

		staff_descriptor.each do |staff_member|
			manager_descriptor.hire staff_member

			customers = current_user.staffs.find(staff_member.id).customers

			customers.each do |cust|
				staff_member.add_customer( turn_customer_model_to_descriptor(cust) )
			end

			customer_descriptor += staff_member.customers
		end

		# To be added in database
		money    = manager_descriptor.money
		current_user.update(money: money)

DELETE FROM "staffs" WHERE "staffs"."id" = 1
---
		end

		staff_descriptor.each do |st|
			current_user.staffs.find(st.id).delete if st.leave?

INSERT INTO "days" ("average_productivity", "average_staff_happiness", "created_at", "day_number", "expenses", "income", "money", "updated_at", "user_id") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?)
---

			)

		if @day.save