app/controllers/staffs_controller.rb

	def index
		@staff = current_user.staffs.all
---
SELECT "staffs".* FROM "staffs"  WHERE "staffs"."user_id" = ?  [["user_id", 2]]

	def show
		@staff = current_user.staffs.find(params[:id])
---
SELECT  "staffs".* FROM "staffs"  WHERE "staffs"."user_id" = ? AND "staffs"."id" = ? LIMIT 1  [["user_id", 1], ["id", 3]]

	def next_page
		page_num = params[:page].to_i
		@staffs = current_user.staffs.pagination(page_num, 5)
		page_count = current_user.staffs.count / 5;
---
SELECT COUNT(*) FROM "staffs"  WHERE "staffs"."user_id" = ?  [["user_id", 1]]