app/controllers/static_pages_controller.rb

SELECT "traits".* FROM "traits"
---
	def welcome_page
		@all_traits = Trait.all